/*
		任何操作之前都先打开库
*/
USE girls;

/*#############################################进阶8：分页查询#############################################*/
/*
		应用场景：当要显示的数据，一页显示不全，需要分页提交SQL请求。
		
		语法：
			SELECT 查询列表		-------------------------------------------------------------⑦
			FROM 表1		-----------------------------------------------------------------①
			【JOIN TYPE JOIN 表2		-----------------------------------------------------②
			ON 连接条件		-----------------------------------------------------------------③
			WHERE 筛选条件		-------------------------------------------------------------④
			GROUP BY 分组字段		---------------------------------------------------------⑤
			HAVING 分组后的筛选		---------------------------------------------------------⑥
			ORDER BY 排序的字段】		-----------------------------------------------------⑧
			LIMIT 要显示条目的起始索引(从0开始)offset,要显示的条目个数size		-------------⑨
		
		特点：	① LIMIT语句放在查询语句的最后。
				② 公式：
					要显示的页数 page,每页的条目数size
					SELECT 查询列表
					FROM 表
					LIMIT (page-1)*size,size;
			
		案例1:查询前五条员工信息
*/
# 写法一：
SELECT *
	FROM employees
	LIMIT 0, 5;

# 写法二：
SELECT *
	FROM employees # 索引默认从0开始。可以省略。
	LIMIT 5;

/*		
		案例2:查询第11条-第25条信息员工信息
*/
SELECT *
	FROM employees
	LIMIT 10, 15;

/*		
		案例3:有奖金的员工信息，并且工资较高的前10名显示出来
*/
SELECT *
	FROM employees
	WHERE commission_pct IS NOT NULL
	ORDER BY salary DESC
	LIMIT 10;

